[Timeout] BlockStatement
src/todo/domain/todo.entity.ts:11:36
   private _createdAt: Date;
   private _updatedAt?: Date;
 
-  constructor(data: CreateTodoDto) {
-    super(data.id);
-    this._title = data.title;
-    this._isDone = data.isDone || false;
-    this._userId = data.user_id;
-    this._createdAt = data.created_at || new Date();
-    this._updatedAt = data.updated_at || new Date();
-  }
+  constructor(data: CreateTodoDto) {}
 
   get title(): string {

[Timeout] BooleanLiteral
src/todo/domain/todo.entity.ts:14:35
   constructor(data: CreateTodoDto) {
     super(data.id);
     this._title = data.title;
-    this._isDone = data.isDone || false;
+    this._isDone = data.isDone || true;
     this._userId = data.user_id;
     this._createdAt = data.created_at || new Date();

[Timeout] ConditionalExpression
src/todo/domain/todo.entity.ts:14:20
   constructor(data: CreateTodoDto) {
     super(data.id);
     this._title = data.title;
-    this._isDone = data.isDone || false;
+    this._isDone = true;
     this._userId = data.user_id;
     this._createdAt = data.created_at || new Date();

[Survived] LogicalOperator
src/todo/domain/todo.entity.ts:16:23
     this._title = data.title;
     this._isDone = data.isDone || false;
     this._userId = data.user_id;
-    this._createdAt = data.created_at || new Date();
+    this._createdAt = data.created_at && new Date();
     this._updatedAt = data.updated_at || new Date();
   }

[Survived] ConditionalExpression
src/todo/domain/todo.entity.ts:16:23
     this._title = data.title;
     this._isDone = data.isDone || false;
     this._userId = data.user_id;
-    this._createdAt = data.created_at || new Date();
+    this._createdAt = false;
     this._updatedAt = data.updated_at || new Date();
   }

[Survived] ConditionalExpression
src/todo/domain/todo.entity.ts:17:23
     this._isDone = data.isDone || false;
     this._userId = data.user_id;
     this._createdAt = data.created_at || new Date();
-    this._updatedAt = data.updated_at || new Date();
+    this._updatedAt = true;
   }
 

[Survived] LogicalOperator
src/todo/domain/todo.entity.ts:17:23
     this._isDone = data.isDone || false;
     this._userId = data.user_id;
     this._createdAt = data.created_at || new Date();
-    this._updatedAt = data.updated_at || new Date();
+    this._updatedAt = data.updated_at && new Date();
   }
 

[Killed] BlockStatement
src/todo/domain/todo.entity.ts:20:23
     this._updatedAt = data.updated_at || new Date();
   }
 
-  get title(): string {
-    return this._title;
-  }
+  get title(): string {}
 
   get isDone(): boolean {
killedBy: ProductDomain constructor should create an instance of TodoDomain with correct values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "My todo"
Received: undefined

[Killed] BlockStatement
src/todo/domain/todo.entity.ts:24:25
     return this._title;
   }
 
-  get isDone(): boolean {
-    return this._isDone;
-  }
+  get isDone(): boolean {}
 
   get userId(): string {
killedBy: ProductDomain setters should update values using setters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/todo/domain/todo.entity.ts:28:24
     return this._isDone;
   }
 
-  get userId(): string {
-    return this._userId;
-  }
+  get userId(): string {}
 
   get created_at(): Date {
killedBy: TodoService update should update the todo if it exists and belongs to the user
statusReason: BadRequestException: Todo doesn't belong to user

[NoCoverage] BlockStatement
src/todo/domain/todo.entity.ts:32:26
     return this._userId;
   }
 
-  get created_at(): Date {
-    return this._createdAt;
-  }
+  get created_at(): Date {}
 
   get updated_at(): Date {

[NoCoverage] BlockStatement
src/todo/domain/todo.entity.ts:36:26
     return this._createdAt;
   }
 
-  get updated_at(): Date {
-    return this._updatedAt;
-  }
+  get updated_at(): Date {}
 
   public setTitle(title: string): TodoDomain {

[Killed] BlockStatement
src/todo/domain/todo.entity.ts:40:46
     return this._updatedAt;
   }
 
-  public setTitle(title: string): TodoDomain {
-    this._title = title;
-    return this;
-  }
+  public setTitle(title: string): TodoDomain {}
 
   public setIsDone(isDone: boolean): TodoDomain {
killedBy: ProductDomain setters should update values using setters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New Todo"
Received: "My todo"

[Killed] BlockStatement
src/todo/domain/todo.entity.ts:45:49
     return this;
   }
 
-  public setIsDone(isDone: boolean): TodoDomain {
-    this._isDone = isDone;
-    return this;
-  }
+  public setIsDone(isDone: boolean): TodoDomain {}
 }
 
killedBy: ProductDomain setters should update values using setters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
