[Timeout] BlockStatement
src/auth/services/auth.service.ts:22:67
     private readonly configService: ConfigService,
   ) {}
 
-  private generateJWTTokens(payload: CreateJwtDto): TokenResponse {
-    const refresh_token = this.getRefreshToken(payload);
-    const access_token = this.jwtService.sign(payload);
-    return {
-      access_token: this.jwtService.sign(payload),
-      access_token_expiry: this.jwtService.decode(access_token).exp,
-      refresh_token: this.getRefreshToken(payload),
-      refresh_token_expiry: this.jwtService.decode(refresh_token).exp,
-    };
-  }
+  private generateJWTTokens(payload: CreateJwtDto): TokenResponse {}
 
   private getRefreshToken(payload: RefreshTokenDto) {

[Timeout] ObjectLiteral
src/auth/services/auth.service.ts:25:12
   private generateJWTTokens(payload: CreateJwtDto): TokenResponse {
     const refresh_token = this.getRefreshToken(payload);
     const access_token = this.jwtService.sign(payload);
-    return {
-      access_token: this.jwtService.sign(payload),
-      access_token_expiry: this.jwtService.decode(access_token).exp,
-      refresh_token: this.getRefreshToken(payload),
-      refresh_token_expiry: this.jwtService.decode(refresh_token).exp,
-    };
+    return {};
   }
 

[Timeout] BlockStatement
src/auth/services/auth.service.ts:33:53
     };
   }
 
-  private getRefreshToken(payload: RefreshTokenDto) {
-    return this.jwtService.sign(payload, {
-      secret: this.configService.get<string>('JWT_REFRESH_SECRET'),
-      expiresIn: this.configService.get<string>('JWT_REFRESH_EXPIRATION_TIME'),
-    });
-  }
+  private getRefreshToken(payload: RefreshTokenDto) {}
 
   async validateUser(

[Timeout] StringLiteral
src/auth/services/auth.service.ts:35:46
 
   private getRefreshToken(payload: RefreshTokenDto) {
     return this.jwtService.sign(payload, {
-      secret: this.configService.get<string>('JWT_REFRESH_SECRET'),
+      secret: this.configService.get<string>(""),
       expiresIn: this.configService.get<string>('JWT_REFRESH_EXPIRATION_TIME'),
     });

[Killed] BlockStatement
src/auth/services/auth.service.ts:43:32
   async validateUser(
     username: string,
     password: string,
-  ): Promise<User | undefined> {
-    const user = await this.usersService.findOne(username);
-    if (user && Bcrypt.compare(password, user.password)) {
-      return user;
-    }
-    return undefined;
-  }
+  ): Promise<User | undefined> {}
 
   async login(user: LoginUserRequest): Promise<AuthenticationResponse> {
killedBy: AuthService validateUser should return a user if credentials are valid
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"email": "test@example.com", "id": "user-id", "password": "$2b$10$YusVBlAuuNOQonTVqJ0bnuis/hAJgWxycex/UaXXv4qmqVI76N95C"}
Received: undefined

[Killed] ConditionalExpression
src/auth/services/auth.service.ts:45:9
     password: string,
   ): Promise<User | undefined> {
     const user = await this.usersService.findOne(username);
-    if (user && Bcrypt.compare(password, user.password)) {
+    if (true) {
       return user;
     }
killedBy: AuthService validateUser should return undefined if user is not found
statusReason: Error: expect(received).toBeUndefined()

Received: null

[Killed] BlockStatement
src/auth/services/auth.service.ts:45:58
     password: string,
   ): Promise<User | undefined> {
     const user = await this.usersService.findOne(username);
-    if (user && Bcrypt.compare(password, user.password)) {
-      return user;
-    }
+    if (user && Bcrypt.compare(password, user.password)) {}
     return undefined;
   }
killedBy: AuthService validateUser should return a user if credentials are valid
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"email": "test@example.com", "id": "user-id", "password": "$2b$10$NMQGMLzS1sdA7KDA6xFyTeKDVViPnsAnBk.7on8p7XKbPBmnS/Ht."}
Received: undefined

[Killed] BlockStatement
src/auth/services/auth.service.ts:51:72
     return undefined;
   }
 
-  async login(user: LoginUserRequest): Promise<AuthenticationResponse> {
-    return {
-      user: {
-        id: user.user_id,
-        email: user.email,
-      },
-      ...this.generateJWTTokens({
-        email: user.email,
-        sub: user.user_id,
-        token: user.token,
-      }),
-    };
-  }
+  async login(user: LoginUserRequest): Promise<AuthenticationResponse> {}
 
   async refreshToken(refreshToken: string): Promise<AuthenticationResponse> {
killedBy: AuthService login should return authentication response with tokens
statusReason: Error: expect(received).toHaveProperty(path)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ObjectLiteral
src/auth/services/auth.service.ts:52:12
   }
 
   async login(user: LoginUserRequest): Promise<AuthenticationResponse> {
-    return {
-      user: {
-        id: user.user_id,
-        email: user.email,
-      },
-      ...this.generateJWTTokens({
-        email: user.email,
-        sub: user.user_id,
-        token: user.token,
-      }),
-    };
+    return {};
   }
 
killedBy: AuthService login should return authentication response with tokens
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "user"
Received path: []

Received value: {}

[Killed] BlockStatement
src/auth/services/auth.service.ts:66:9
   }
 
   async refreshToken(refreshToken: string): Promise<AuthenticationResponse> {
-    try {
-      const payload = this.jwtService.verify<RefreshTokenDto>(refreshToken, {
-        secret: this.configService.get<string>('JWT_REFRESH_SECRET'),
-      });
-
-      const new_user = await this.usersService.validRefreshToken(
-        payload.sub,
-        payload.token,
-      );
-
-      if (!new_user) throw new UnauthorizedException('Invalid refresh token');
-
-      return {
-        user: {
-          id: new_user.id,
-          email: new_user.email,
-        },
-        ...this.generateJWTTokens({
-          email: payload.email,
-          sub: payload.sub,
-          token: new_user.refresh_token,
-        }),
-      };
-    } catch (e) {
+    try {} catch (e) {
       console.log(e);
       throw new UnauthorizedException('Invalid refresh token');
killedBy: AuthService refreshToken should return a new authentication response with new tokens
statusReason: Error: expect(received).toHaveProperty(path)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BooleanLiteral
src/auth/services/auth.service.ts:76:11
         payload.token,
       );
 
-      if (!new_user) throw new UnauthorizedException('Invalid refresh token');
+      if (new_user) throw new UnauthorizedException('Invalid refresh token');
 
       return {
killedBy: AuthService refreshToken should return a new authentication response with new tokens
statusReason: UnauthorizedException: Invalid refresh token

[Killed] ConditionalExpression
src/auth/services/auth.service.ts:76:11
         payload.token,
       );
 
-      if (!new_user) throw new UnauthorizedException('Invalid refresh token');
+      if (true) throw new UnauthorizedException('Invalid refresh token');
 
       return {
killedBy: AuthService refreshToken should return a new authentication response with new tokens
statusReason: UnauthorizedException: Invalid refresh token

[Killed] ObjectLiteral
src/auth/services/auth.service.ts:79:15
       if (!new_user) throw new UnauthorizedException('Invalid refresh token');
 
       return {
-        user: {
-          id: new_user.id,
-          email: new_user.email,
-        },
+        user: {},
         ...this.generateJWTTokens({
           email: payload.email,
killedBy: AuthService refreshToken should return a new authentication response with new tokens
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "email": "test@example.com",
-   "id": "user-id",

[Survived] ObjectLiteral
src/auth/services/auth.service.ts:83:35
           id: new_user.id,
           email: new_user.email,
         },
-        ...this.generateJWTTokens({
-          email: payload.email,
-          sub: payload.sub,
-          token: new_user.refresh_token,
-        }),
+        ...this.generateJWTTokens({}),
       };
     } catch (e) {

[Killed] BlockStatement
src/auth/services/auth.service.ts:89:17
           token: new_user.refresh_token,
         }),
       };
-    } catch (e) {
-      console.log(e);
-      throw new UnauthorizedException('Invalid refresh token');
-    }
+    } catch (e) {}
   }
 }
killedBy: AuthService refreshToken should throw an UnauthorizedException if refresh token is invalid
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined
