[Killed] BlockStatement
src/shared/utils/date.ts:1:77
-export function getDaysBetweenDates(startDate: Date, endDate: Date): number {
-  const differenceInMs = endDate.getTime() - startDate.getTime();
-  const daysDifference = Math.floor(differenceInMs / (1000 * 60 * 60 * 24));
-
-  return daysDifference;
-}
+export function getDaysBetweenDates(startDate: Date, endDate: Date): number {}
 
killedBy: getDaysBetweenDates should return the correct number of days between two dates
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: undefined

[Killed] ArithmeticOperator
src/shared/utils/date.ts:2:26
 export function getDaysBetweenDates(startDate: Date, endDate: Date): number {
-  const differenceInMs = endDate.getTime() - startDate.getTime();
+  const differenceInMs = endDate.getTime() + startDate.getTime();
   const daysDifference = Math.floor(differenceInMs / (1000 * 60 * 60 * 24));
 
killedBy: getDaysBetweenDates should return the correct number of days between two dates
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 39455

[Killed] ArithmeticOperator
src/shared/utils/date.ts:3:55
 export function getDaysBetweenDates(startDate: Date, endDate: Date): number {
   const differenceInMs = endDate.getTime() - startDate.getTime();
-  const daysDifference = Math.floor(differenceInMs / (1000 * 60 * 60 * 24));
+  const daysDifference = Math.floor(differenceInMs / (1000 * 60 / 60 * 24));
 
   return daysDifference;
killedBy: getDaysBetweenDates should return the correct number of days between two dates
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 32400

[Killed] ArithmeticOperator
src/shared/utils/date.ts:3:55
 export function getDaysBetweenDates(startDate: Date, endDate: Date): number {
   const differenceInMs = endDate.getTime() - startDate.getTime();
-  const daysDifference = Math.floor(differenceInMs / (1000 * 60 * 60 * 24));
+  const daysDifference = Math.floor(differenceInMs / (1000 * 60 * 60 / 24));
 
   return daysDifference;
killedBy: getDaysBetweenDates should return the correct number of days between two dates
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 5184
