[Killed] BlockStatement
src/shared/utils/bCrypt.ts:4:56
 import { compareSync, hashSync } from 'bcrypt';
 
 export class Bcrypt {
-  static hash(password: string, salt?: number): string {
-    return salt ? hashSync(password, salt) : hashSync(password, 10);
-  }
+  static hash(password: string, salt?: number): string {}
 
   static compare(password: string, hash: string): boolean {
killedBy: AuthService validateUser should return a user if credentials are valid
statusReason: Error: data and hash arguments required

[Timeout] BlockStatement
src/shared/utils/bCrypt.ts:8:59
     return salt ? hashSync(password, salt) : hashSync(password, 10);
   }
 
-  static compare(password: string, hash: string): boolean {
-    return compareSync(password, hash);
-  }
+  static compare(password: string, hash: string): boolean {}
 }
 
