[Killed] BlockStatement
src/shared/utils/realAge.ts:1:68
-export function realAge(birthDate: Date, today: Date = new Date()) {
-  let age = today.getFullYear() - birthDate.getFullYear();
-  const m = today.getMonth() - birthDate.getMonth();
-  if (m < 0 || (m === 0 && today.getDate() < birthDate.getDate())) {
-    age--;
-  }
-  return age;
-}
+export function realAge(birthDate: Date, today: Date = new Date()) {}
 
killedBy: realAge should return correct age for a given birth date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 34
Received: undefined

[Killed] ArithmeticOperator
src/shared/utils/realAge.ts:2:13
 export function realAge(birthDate: Date, today: Date = new Date()) {
-  let age = today.getFullYear() - birthDate.getFullYear();
+  let age = today.getFullYear() + birthDate.getFullYear();
   const m = today.getMonth() - birthDate.getMonth();
   if (m < 0 || (m === 0 && today.getDate() < birthDate.getDate())) {
killedBy: realAge should return correct age for a given birth date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 34
Received: 4012

[Killed] ArithmeticOperator
src/shared/utils/realAge.ts:3:13
 export function realAge(birthDate: Date, today: Date = new Date()) {
   let age = today.getFullYear() - birthDate.getFullYear();
-  const m = today.getMonth() - birthDate.getMonth();
+  const m = today.getMonth() + birthDate.getMonth();
   if (m < 0 || (m === 0 && today.getDate() < birthDate.getDate())) {
     age--;
killedBy: realAge should return correct age for a given birth date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 34
Received: 35

[Killed] EqualityOperator
src/shared/utils/realAge.ts:4:7
 export function realAge(birthDate: Date, today: Date = new Date()) {
   let age = today.getFullYear() - birthDate.getFullYear();
   const m = today.getMonth() - birthDate.getMonth();
-  if (m < 0 || (m === 0 && today.getDate() < birthDate.getDate())) {
+  if (m >= 0 || (m === 0 && today.getDate() < birthDate.getDate())) {
     age--;
   }
killedBy: realAge should return correct age for a given birth date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 34
Received: 35

[Killed] EqualityOperator
src/shared/utils/realAge.ts:4:28
 export function realAge(birthDate: Date, today: Date = new Date()) {
   let age = today.getFullYear() - birthDate.getFullYear();
   const m = today.getMonth() - birthDate.getMonth();
-  if (m < 0 || (m === 0 && today.getDate() < birthDate.getDate())) {
+  if (m < 0 || (m === 0 && today.getDate() >= birthDate.getDate())) {
     age--;
   }
killedBy: realAge should return correct age when birthday has not occurred yet this year
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 33
Received: 34

[Killed] UpdateOperator
src/shared/utils/realAge.ts:5:5
   let age = today.getFullYear() - birthDate.getFullYear();
   const m = today.getMonth() - birthDate.getMonth();
   if (m < 0 || (m === 0 && today.getDate() < birthDate.getDate())) {
-    age--;
+    age++;
   }
   return age;
killedBy: realAge should return correct age for a given birth date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 34
Received: 36
