[Killed] BlockStatement
src/shared/utils/generate_id.ts:3:32
 import { randomUUID } from 'crypto';
 
-export function generateV4Id() {
-  return randomUUID();
-}
+export function generateV4Id() {}
 
killedBy: generateV4Id should return a valid UUID v4
statusReason: Error: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined
