[Killed] BlockStatement
src/todo/services/todo.service.ts:14:58
     private readonly todoRepository: ITodoRepository,
   ) {}
 
-  async listUser(user_id: string): Promise<TodoDomain[]> {
-    return this.todoRepository.findByUserId(user_id);
-  }
+  async listUser(user_id: string): Promise<TodoDomain[]> {}
 
   async create(
killedBy: TodoService listUser should return todos for the user when found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: undefined

[Killed] BlockStatement
src/todo/services/todo.service.ts:21:26
   async create(
     createUserDto: CreateTodoRequest,
     user_id: string,
-  ): Promise<TodoDomain> {
-    const todo = new TodoDomain({
-      title: createUserDto.title,
-      user_id: user_id,
-      isDone: false,
-    });
-    return this.todoRepository.create(todo);
-  }
+  ): Promise<TodoDomain> {}
 
   async update(
killedBy: TodoService create should create a new todo for the user
statusReason: TypeError: Cannot read properties of undefined (reading 'title')

[Survived] BooleanLiteral
src/todo/services/todo.service.ts:25:15
     const todo = new TodoDomain({
       title: createUserDto.title,
       user_id: user_id,
-      isDone: false,
+      isDone: true,
     });
     return this.todoRepository.create(todo);

[Killed] BlockStatement
src/todo/services/todo.service.ts:34:26
     user_id: string,
     id: string,
     todo: UpdateTodoRequest,
-  ): Promise<TodoDomain> {
-    const todo_exists = await this.todoRepository.findById(id);
-
-    if (!todo_exists) {
-      throw new BadRequestException("Todo doesn't exist");
-    }
-
-    if (todo_exists.userId !== user_id) {
-      throw new BadRequestException("Todo doesn't belong to user");
-    }
-
-    const new_todo = new TodoDomain({
-      id: todo_exists.id,
-      title: todo.title || todo_exists.title,
-      isDone: todo.isDone || todo_exists.isDone,
-      user_id: todo_exists.userId,
-    });
-
-    return this.todoRepository.update(new_todo);
-  }
+  ): Promise<TodoDomain> {}
 
   async delete(id: string, user_id: string): Promise<void> {
killedBy: TodoService update should throw an error if the todo doesn't exist
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/todo/services/todo.service.ts:37:23
   ): Promise<TodoDomain> {
     const todo_exists = await this.todoRepository.findById(id);
 
-    if (!todo_exists) {
-      throw new BadRequestException("Todo doesn't exist");
-    }
+    if (!todo_exists) {}
 
     if (todo_exists.userId !== user_id) {
killedBy: TodoService update should throw an error if the todo doesn't exist
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Todo doesn't exist"
Received message: "Cannot read properties of undefined (reading 'userId')"

      90 |         }
      91 |       }
    > 92 |       if (stryMutAct_9fa48("85") ? todo_exists.userId === user_id : stryMutAct_9fa48("84") ? false : stryMutAct_9fa48("83") ? true : (stryCov_9fa48("83", "84", "85"), todo_exists.user

[Killed] ConditionalExpression
src/todo/services/todo.service.ts:37:9
   ): Promise<TodoDomain> {
     const todo_exists = await this.todoRepository.findById(id);
 
-    if (!todo_exists) {
+    if (false) {
       throw new BadRequestException("Todo doesn't exist");
     }
killedBy: TodoService update should throw an error if the todo doesn't exist
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Todo doesn't exist"
Received message: "Cannot read properties of undefined (reading 'userId')"

      90 |         }
      91 |       }
    > 92 |       if (stryMutAct_9fa48("85") ? todo_exists.userId === user_id : stryMutAct_9fa48("84") ? false : stryMutAct_9fa48("83") ? true : (stryCov_9fa48("83", "84", "85"), todo_exists.user

[Killed] ConditionalExpression
src/todo/services/todo.service.ts:41:9
       throw new BadRequestException("Todo doesn't exist");
     }
 
-    if (todo_exists.userId !== user_id) {
+    if (true) {
       throw new BadRequestException("Todo doesn't belong to user");
     }
killedBy: TodoService update should update the todo if it exists and belongs to the user
statusReason: BadRequestException: Todo doesn't belong to user

[Killed] ConditionalExpression
src/todo/services/todo.service.ts:41:9
       throw new BadRequestException("Todo doesn't exist");
     }
 
-    if (todo_exists.userId !== user_id) {
+    if (false) {
       throw new BadRequestException("Todo doesn't belong to user");
     }
killedBy: TodoService update should throw an error if the todo doesn't belong to the user
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/todo/services/todo.service.ts:42:37
     }
 
     if (todo_exists.userId !== user_id) {
-      throw new BadRequestException("Todo doesn't belong to user");
+      throw new BadRequestException("");
     }
 
killedBy: TodoService update should throw an error if the todo doesn't belong to the user
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Todo doesn't belong to user"
Received message: "Bad Request"

       95 |         } else {
       96 |           stryCov_9fa48("86");
    >  97 |           throw new BadRequestException(stryMutAct_9fa48("87") ? "" : (stryCov_9fa48("87"), "Todo doesn't belong to user"));

[Killed] ObjectLiteral
src/todo/services/todo.service.ts:45:37
       throw new BadRequestException("Todo doesn't belong to user");
     }
 
-    const new_todo = new TodoDomain({
-      id: todo_exists.id,
-      title: todo.title || todo_exists.title,
-      isDone: todo.isDone || todo_exists.isDone,
-      user_id: todo_exists.userId,
-    });
+    const new_todo = new TodoDomain({});
 
     return this.todoRepository.update(new_todo);
killedBy: TodoService update should update the todo if it exists and belongs to the user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  TodoDomain {
-   "_createdAt": 2025-01-03T22:50:14.145Z,
-   "_id": "todo-id",

[Killed] ConditionalExpression
src/todo/services/todo.service.ts:47:14
 
     const new_todo = new TodoDomain({
       id: todo_exists.id,
-      title: todo.title || todo_exists.title,
+      title: false,
       isDone: todo.isDone || todo_exists.isDone,
       user_id: todo_exists.userId,
killedBy: TodoService update should update the todo if it exists and belongs to the user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  TodoDomain {
    "_createdAt": 2025-01-03T22:50:15.583Z,
    "_id": "todo-id",

[Killed] ConditionalExpression
src/todo/services/todo.service.ts:47:14
 
     const new_todo = new TodoDomain({
       id: todo_exists.id,
-      title: todo.title || todo_exists.title,
+      title: true,
       isDone: todo.isDone || todo_exists.isDone,
       user_id: todo_exists.userId,
killedBy: TodoService update should update the todo if it exists and belongs to the user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  TodoDomain {
    "_createdAt": 2025-01-03T22:50:14.685Z,
    "_id": "todo-id",

[Killed] LogicalOperator
src/todo/services/todo.service.ts:48:15
     const new_todo = new TodoDomain({
       id: todo_exists.id,
       title: todo.title || todo_exists.title,
-      isDone: todo.isDone || todo_exists.isDone,
+      isDone: todo.isDone && todo_exists.isDone,
       user_id: todo_exists.userId,
     });
killedBy: TodoService update should update the todo if it exists and belongs to the user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  TodoDomain {
    "_createdAt": 2025-01-03T22:50:17.051Z,
    "_id": "todo-id",

[Killed] ConditionalExpression
src/todo/services/todo.service.ts:48:15
     const new_todo = new TodoDomain({
       id: todo_exists.id,
       title: todo.title || todo_exists.title,
-      isDone: todo.isDone || todo_exists.isDone,
+      isDone: false,
       user_id: todo_exists.userId,
     });
killedBy: TodoService update should update the todo if it exists and belongs to the user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  TodoDomain {
    "_createdAt": 2025-01-03T22:50:17.383Z,
    "_id": "todo-id",

[Killed] BlockStatement
src/todo/services/todo.service.ts:55:60
     return this.todoRepository.update(new_todo);
   }
 
-  async delete(id: string, user_id: string): Promise<void> {
-    const todo_exists = await this.todoRepository.findById(id);
-
-    if (!todo_exists) {
-      throw new BadRequestException("Todo doesn't exist");
-    }
-
-    if (todo_exists.userId !== user_id) {
-      throw new BadRequestException("Todo doesn't belong to user");
-    }
-
-    return this.todoRepository.delete(id);
-  }
+  async delete(id: string, user_id: string): Promise<void> {}
 }
 
killedBy: TodoService delete should throw an error if the todo doesn't exist
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/todo/services/todo.service.ts:58:9
   async delete(id: string, user_id: string): Promise<void> {
     const todo_exists = await this.todoRepository.findById(id);
 
-    if (!todo_exists) {
+    if (true) {
       throw new BadRequestException("Todo doesn't exist");
     }
killedBy: TodoService delete should throw an error if the todo doesn't belong to the user
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Todo doesn't belong to user"
Received message: "Todo doesn't exist"

      118 |         } else {
      119 |           stryCov_9fa48("99");
    > 120 |           throw new BadRequestException(stryMutAct_9fa48("100") ? "" : (stryCov_9fa48("100"), "Todo doesn't exist"));

[Killed] BooleanLiteral
src/todo/services/todo.service.ts:58:9
   async delete(id: string, user_id: string): Promise<void> {
     const todo_exists = await this.todoRepository.findById(id);
 
-    if (!todo_exists) {
+    if (todo_exists) {
       throw new BadRequestException("Todo doesn't exist");
     }
killedBy: TodoService delete should throw an error if the todo doesn't exist
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Todo doesn't exist"
Received message: "Cannot read properties of undefined (reading 'userId')"

      121 |         }
      122 |       }
    > 123 |       if (stryMutAct_9fa48("103") ? todo_exists.userId === user_id : stryMutAct_9fa48("102") ? false : stryMutAct_9fa48("101") ? true : (stryCov_9fa48("101", "102", "103"), todo_ex

[Killed] EqualityOperator
src/todo/services/todo.service.ts:62:9
       throw new BadRequestException("Todo doesn't exist");
     }
 
-    if (todo_exists.userId !== user_id) {
+    if (todo_exists.userId === user_id) {
       throw new BadRequestException("Todo doesn't belong to user");
     }
killedBy: TodoService delete should throw an error if the todo doesn't belong to the user
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined
