[Timeout] BlockStatement
src/users/domain/user.entity.ts:14:36
   private _createdAt: Date;
   private _updatedAt?: Date;
 
-  constructor(data: CreateUserDto) {
-    super(data.id);
-    this._name = data.name;
-    this._email = data.email;
-    this._password = data.password_hash;
-    this._refreshToken = data.refresh_token;
-    this._createdAt = data.created_at || new Date();
-    this._updatedAt = data.updated_at || new Date();
-  }
+  constructor(data: CreateUserDto) {}
 
   get name(): string {

[Timeout] LogicalOperator
src/users/domain/user.entity.ts:20:23
     this._email = data.email;
     this._password = data.password_hash;
     this._refreshToken = data.refresh_token;
-    this._createdAt = data.created_at || new Date();
+    this._createdAt = data.created_at && new Date();
     this._updatedAt = data.updated_at || new Date();
   }

[Timeout] ConditionalExpression
src/users/domain/user.entity.ts:20:23
     this._email = data.email;
     this._password = data.password_hash;
     this._refreshToken = data.refresh_token;
-    this._createdAt = data.created_at || new Date();
+    this._createdAt = false;
     this._updatedAt = data.updated_at || new Date();
   }

[Timeout] ConditionalExpression
src/users/domain/user.entity.ts:21:23
     this._password = data.password_hash;
     this._refreshToken = data.refresh_token;
     this._createdAt = data.created_at || new Date();
-    this._updatedAt = data.updated_at || new Date();
+    this._updatedAt = false;
   }
 

[Timeout] BlockStatement
src/users/domain/user.entity.ts:24:22
     this._updatedAt = data.updated_at || new Date();
   }
 
-  get name(): string {
-    return this._name;
-  }
+  get name(): string {}
 
   get email(): string {

[Timeout] BlockStatement
src/users/domain/user.entity.ts:28:23
     return this._name;
   }
 
-  get email(): string {
-    return this._email;
-  }
+  get email(): string {}
 
   get refresh_token(): string | undefined {

[Timeout] BlockStatement
src/users/domain/user.entity.ts:32:43
     return this._email;
   }
 
-  get refresh_token(): string | undefined {
-    return this._refreshToken;
-  }
+  get refresh_token(): string | undefined {}
 
   get updated_at(): Date | undefined {

[Timeout] BlockStatement
src/users/domain/user.entity.ts:36:38
     return this._refreshToken;
   }
 
-  get updated_at(): Date | undefined {
-    return this._updatedAt;
-  }
+  get updated_at(): Date | undefined {}
 
   get created_at(): Date {

[Timeout] BlockStatement
src/users/domain/user.entity.ts:44:38
     return this._createdAt;
   }
 
-  get password(): string | undefined {
-    return this._password;
-  }
+  get password(): string | undefined {}
 
   public setEmail(email: string): UserDomain {

[Timeout] BlockStatement
src/users/domain/user.entity.ts:48:46
     return this._password;
   }
 
-  public setEmail(email: string): UserDomain {
-    this._email = email;
-    return this;
-  }
+  public setEmail(email: string): UserDomain {}
 
   public setName(name: string): UserDomain {

[Killed] BlockStatement
src/users/domain/user.entity.ts:53:44
     return this;
   }
 
-  public setName(name: string): UserDomain {
-    this._name = name;
-    return this;
-  }
+  public setName(name: string): UserDomain {}
 
   public setRefreshToken(token: string): UserDomain {
killedBy: UserDomain should set name correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Updated User"
Received: "Test User"

[Killed] BlockStatement
src/users/domain/user.entity.ts:58:53
     return this;
   }
 
-  public setRefreshToken(token: string): UserDomain {
-    this._refreshToken = token;
-    return this;
-  }
+  public setRefreshToken(token: string): UserDomain {}
 
   private hashPassword(password: string): string {
killedBy: UserDomain should set refresh token correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "new_refresh_token"
Received: "refresh_token"

[Survived] BlockStatement
src/users/domain/user.entity.ts:63:50
     return this;
   }
 
-  private hashPassword(password: string): string {
-    return Bcrypt.hash(password, bcrypt_salt);
-  }
+  private hashPassword(password: string): string {}
 
   public setPassword(password: string): UserDomain {

[Survived] BlockStatement
src/users/domain/user.entity.ts:67:52
     return Bcrypt.hash(password, bcrypt_salt);
   }
 
-  public setPassword(password: string): UserDomain {
-    this._password = this.hashPassword(password);
-    return this;
-  }
+  public setPassword(password: string): UserDomain {}
 }
 
