[Timeout] BlockStatement
src/users/services/users.service.ts:15:65
     private readonly usersRepository: IUsersRepository,
   ) {}
 
-  async findOne(email: string): Promise<UserDomain | undefined> {
-    return this.usersRepository.findOneByEmail(email);
-  }
+  async findOne(email: string): Promise<UserDomain | undefined> {}
 
   async findById(id: string): Promise<UserDomain | undefined> {

[Timeout] BlockStatement
src/users/services/users.service.ts:19:63
     return this.usersRepository.findOneByEmail(email);
   }
 
-  async findById(id: string): Promise<UserDomain | undefined> {
-    return this.usersRepository.findById(id);
-  }
+  async findById(id: string): Promise<UserDomain | undefined> {}
 
   async create(createUserDto: CreateUserRequest): Promise<UserDomain> {

[Timeout] BlockStatement
src/users/services/users.service.ts:23:71
     return this.usersRepository.findById(id);
   }
 
-  async create(createUserDto: CreateUserRequest): Promise<UserDomain> {
-    const user_exists = await this.usersRepository.findOneByEmail(
-      createUserDto.email,
-    );
-
-    if (user_exists) {
-      throw new BadRequestException('User already exists');
-    }
-
-    const user = new UserDomain({
-      email: createUserDto.email,
-      name: createUserDto.name,
-    });
-    user.setPassword(createUserDto.password);
-    user.setRefreshToken(randomUUID());
-    return this.usersRepository.create(user);
-  }
+  async create(createUserDto: CreateUserRequest): Promise<UserDomain> {}
 
   async update(id: string, user: UpdateUserRequest): Promise<UserDomain> {

[Killed] ConditionalExpression
src/users/services/users.service.ts:28:9
       createUserDto.email,
     );
 
-    if (user_exists) {
+    if (false) {
       throw new BadRequestException('User already exists');
     }
killedBy: UsersService create should throw an error if the user already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/users/services/users.service.ts:28:22
       createUserDto.email,
     );
 
-    if (user_exists) {
-      throw new BadRequestException('User already exists');
-    }
+    if (user_exists) {}
 
     const user = new UserDomain({
killedBy: UsersService create should throw an error if the user already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/users/services/users.service.ts:41:74
     return this.usersRepository.create(user);
   }
 
-  async update(id: string, user: UpdateUserRequest): Promise<UserDomain> {
-    const user_exists = await this.usersRepository.findById(id);
-
-    if (!user_exists) {
-      throw new BadRequestException("User doesn't exist");
-    }
-
-    const new_user = new UserDomain({
-      id: user_exists.id,
-      email: user.email || user_exists.email,
-      name: user.name || user_exists.name,
-    });
-
-    return this.usersRepository.update(new_user);
-  }
+  async update(id: string, user: UpdateUserRequest): Promise<UserDomain> {}
 
   async delete(id: string): Promise<void> {
killedBy: UsersService update should throw an error if the user doesn't exist
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/users/services/users.service.ts:44:23
   async update(id: string, user: UpdateUserRequest): Promise<UserDomain> {
     const user_exists = await this.usersRepository.findById(id);
 
-    if (!user_exists) {
-      throw new BadRequestException("User doesn't exist");
-    }
+    if (!user_exists) {}
 
     const new_user = new UserDomain({
killedBy: UsersService update should throw an error if the user doesn't exist
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "User doesn't exist"
Received message: "Cannot read properties of undefined (reading 'id')"

      110 |       }
      111 |       const new_user = new UserDomain(stryMutAct_9fa48("138") ? {} : (stryCov_9fa48("138"), {
    > 112 |         id: user_exists.id,

[Killed] ConditionalExpression
src/users/services/users.service.ts:44:9
   async update(id: string, user: UpdateUserRequest): Promise<UserDomain> {
     const user_exists = await this.usersRepository.findById(id);
 
-    if (!user_exists) {
+    if (true) {
       throw new BadRequestException("User doesn't exist");
     }
killedBy: UsersService update should update and return the updated user if the user exists
statusReason: BadRequestException: User doesn't exist

[Survived] LogicalOperator
src/users/services/users.service.ts:50:14
 
     const new_user = new UserDomain({
       id: user_exists.id,
-      email: user.email || user_exists.email,
+      email: user.email && user_exists.email,
       name: user.name || user_exists.name,
     });

[Survived] ConditionalExpression
src/users/services/users.service.ts:50:14
 
     const new_user = new UserDomain({
       id: user_exists.id,
-      email: user.email || user_exists.email,
+      email: false,
       name: user.name || user_exists.name,
     });

[Survived] LogicalOperator
src/users/services/users.service.ts:51:13
     const new_user = new UserDomain({
       id: user_exists.id,
       email: user.email || user_exists.email,
-      name: user.name || user_exists.name,
+      name: user.name && user_exists.name,
     });
 

[Survived] ConditionalExpression
src/users/services/users.service.ts:51:13
     const new_user = new UserDomain({
       id: user_exists.id,
       email: user.email || user_exists.email,
-      name: user.name || user_exists.name,
+      name: false,
     });
 

[Killed] BlockStatement
src/users/services/users.service.ts:57:43
     return this.usersRepository.update(new_user);
   }
 
-  async delete(id: string): Promise<void> {
-    const user_exists = await this.usersRepository.findById(id);
-
-    if (!user_exists) {
-      throw new BadRequestException("User doesn't exist");
-    }
-
-    return this.usersRepository.delete(id);
-  }
+  async delete(id: string): Promise<void> {}
 
   async validRefreshToken(
killedBy: UsersService delete should throw an error if the user doesn't exist
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/users/services/users.service.ts:60:9
   async delete(id: string): Promise<void> {
     const user_exists = await this.usersRepository.findById(id);
 
-    if (!user_exists) {
+    if (false) {
       throw new BadRequestException("User doesn't exist");
     }
killedBy: UsersService delete should throw an error if the user doesn't exist
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/users/services/users.service.ts:70:38
   async validRefreshToken(
     userId: string,
     token: string,
-  ): Promise<UserDomain | undefined> {
-    const user = await this.usersRepository.findById(userId);
-
-    if (!user || user.refresh_token !== token) return undefined;
-
-    const newToken = randomUUID();
-    return this.usersRepository.updateRefreshToken(userId, newToken);
-  }
+  ): Promise<UserDomain | undefined> {}
 }
 
killedBy: UsersService validRefreshToken should update the refresh token if it matches the existing token
statusReason: Error: expect(received).toHaveProperty(path, value)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ConditionalExpression
src/users/services/users.service.ts:73:9
   ): Promise<UserDomain | undefined> {
     const user = await this.usersRepository.findById(userId);
 
-    if (!user || user.refresh_token !== token) return undefined;
+    if (true) return undefined;
 
     const newToken = randomUUID();
killedBy: UsersService validRefreshToken should update the refresh token if it matches the existing token
statusReason: Error: expect(received).toHaveProperty(path, value)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] LogicalOperator
src/users/services/users.service.ts:73:9
   ): Promise<UserDomain | undefined> {
     const user = await this.usersRepository.findById(userId);
 
-    if (!user || user.refresh_token !== token) return undefined;
+    if (!user && user.refresh_token !== token) return undefined;
 
     const newToken = randomUUID();
killedBy: UsersService validRefreshToken should return undefined if the user or token is invalid
statusReason: TypeError: Cannot read properties of undefined (reading 'refresh_token')
